IDENTIFICATION DIVISION.
PROGRAM-ID. AddNums.
* Initialize variables
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3) VALUE 10.
01 NUM2 PIC 9(3) VALUE 20.
* Store sum
01 SUM PIC 9(4).
PROCEDURE DIVISION.
* Calculate sum
COMPUTE SUM = NUM1 + NUM2.
STOP RUN.