IDENTIFICATION DIVISION.
PROGRAM-ID. CalcDiff.
* Set up numbers
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(3) VALUE 50.
* Store result
01 RESULT PIC 9(4).
* Subtract value
PROCEDURE DIVISION.
COMPUTE RESULT = NUM1 - 10.
STOP RUN.