IDENTIFICATION DIVISION.
PROGRAM-ID. PrintMsg.
* Define message
DATA DIVISION.
WORKING-STORAGE SECTION.
01 MSG PIC X(20) VALUE 'Hello World'.
* Display output
PROCEDURE DIVISION.
DISPLAY MSG.
STOP RUN.